{
  "name": "plugin-temp-1",
  "display_name": "Plugin Template 1",
  "type": "plugin",
  "version": "0.1",
  "page": "plugin-page",
  "main_file_name": "plugin_template.php",
  "main_folder_name":"plugin_template_1",
  "redcap_add_edit_records_page": "false",
  "redcap_control_center": "false",
  "redcap_custom_verify_username": "false",
  "redcap_data_entry_form": "false",
  "redcap_data_entry_form_top": "false",
  "redcap_every_page_before_render": "false",
  "redcap_every_page_top": "false",
  "redcap_project_home_page": "false",
  "redcap_save_record": "false",
  "redcap_survey_complete": "false",
  "redcap_survey_page": "false",
  "redcap_survey_page_top": "false",
  "redcap_user_rights": "false",
  "description": {
    "ENG": "Sample plugin, added to the Online Designer's Advanced Tools, that contains underlying code showing how to add plugins to the Swiss Army Framework.",
    "ESP": "Ejemplo de plugin, agregado a las Herramientas avanzadas del disenador en linea, que contiene el codigo subyacente que muestra como agregar Plugins al Marco del Swiss Army.",
    "FRN": "Exemple de plugin, ajoute aux outils avances du concepteur en ligne, qui contient du code sous-jacent montrant comment ajouter des plugins au Swiss Army Framework.",
    "GRM": "Beispiel-Plugin, das zu den erweiterten Tools des Online-Designers hinzugefugt wurde und den zugrunde liegenden Code zum Hinzufugen von Plugins zum Swiss Army Framework enthalt.",
    "POR": "Plug-in de amostra, adicionado as Ferramentas avancadas do Online Designer, que contem o codigo subjacente que mostra como adicionar plug-ins ao Swiss Army Framework."
  },
  "short-description":{
    "ENG": "Sample link of the Plugin template provided with this Swiss Army Framework.",
    "ESP": "Enlace de muestra de Plugins de complemento proporcionada con este marco del ejercito suizo.",
    "FRN": "Exemple de lien du modele de plugin fourni avec ce cadre de l'armee suisse.",
    "GRM": "Beispiellink der Plugin-Vorlage, die mit diesem Swiss Army Framework bereitgestellt wird.",
    "POR": "Exemplo de link do modelo de plug-in fornecido com este Swiss Army Framework."
  },
  "help-tool-tip":{
    "ENG": "Message to Developer: Please describe why, when, and how it makes our lives easier.",
    "ESP": "Mensaje para el desarrollador: Describa por que, cuando y como nos facilita la vida.",
    "FRN": "Message au developpeur: veuillez decrire pourquoi, quand et comment cela nous facilite la vie.",
    "GRM": "Nachricht an den Entwickler: Bitte beschreiben Sie, warum, wann und wie dies unser Leben erleichtert.",
    "POR": "Mensagem para o desenvolvedor: descreva por que, quando e como isso facilita nossas vidas."
  },
  "author-sign": "Ed Morales - Boston Ma - emorales7@partners.org"
}